## Importing Pandas Library

In [1]:
import pandas as pd

## Importing data file in the Python environment
Change the Windows folder location as per your system

In [2]:
imp_data = pd.read_csv("C:\\Ujjwal\\Analytics\\Git\\Data_Wrangling_Tips_Tricks\\Scenario_2\\cars.csv")
imp_data.head(2)

,Model,Actual MPG,Cylinders,Horsepower,Weight,Year,Origin
0,amc ambassador dpl,15.0,8,190,3850,70,American
1,amc gremlin,21.0,6,90,2648,70,American

## Groupby dataframe on the basis of Year

In [3]:
groupby_df = imp_data.groupby("Year")

##### Checking the components of groupby object (only 2 rows and 2 columns of dataframe slice are shown)

In [5]:
for name, df in groupby_df:
    print(f"Name of the group is {name}")
    print(df.iloc[:2,:2])

Name of the group is 70
                Model   Actual MPG
0  amc ambassador dpl         15.0
1         amc gremlin         21.0
Name of the group is 71
                         Model   Actual MPG
29                 amc gremlin         19.0
30  amc hornet sportabout (sw)         18.0
Name of the group is 72
                 Model   Actual MPG
56  amc ambassador sst         17.0
57    amc matador (sw)         15.0
Name of the group is 73
                      Model   Actual MPG
84  amc ambassador brougham         13.0
85              amc gremlin         18.0
Name of the group is 74
           Model   Actual MPG
124   amc hornet         19.0
125  amc matador         16.0
Name of the group is 75
           Model   Actual MPG
150  amc gremlin         20.0
151  amc matador         15.0
Name of the group is 76
           Model   Actual MPG
180   amc hornet         22.5
181  amc matador         15.5
Name of the group is 77
                       Model   Actual MPG
214  buick opel isuzu deluxe         30.0
215            buick skylark         20.5
Name of the group is 78
               Model   Actual MPG
242      amc concord         19.4
243  amc concord d/l         18.1
Name of the group is 79
                Model   Actual MPG
278  amc concord dl 6         20.2
279     amc spirit dl         27.4
Name of the group is 80
                  Model   Actual MPG
307         amc concord         24.3
308  chevrolet chevette         32.1
Name of the group is 81
             Model   Actual MPG
334  buick century         22.4
335  buick skylark         26.6
Name of the group is 82
                     Model   Actual MPG
362  buick century limited         25.0
363       chevrolet camaro         27.0

## Convert the groupby object in to tuple

In [6]:
tuple_groupby_df = tuple(groupby_df)

In [7]:
print(tuple_groupby_df[0])

(70,                            Model   Actual MPG  Cylinders  Horsepower  Weight  \
0             amc ambassador dpl         15.0          8         190    3850
1                    amc gremlin         21.0          6          90    2648
2                     amc hornet         18.0          6          97    2774
3                  amc rebel sst         16.0          8         150    3433
4        buick estate wagon (sw)         14.0          8         225    3086
5              buick skylark 320         15.0          8         165    3693
6      chevrolet chevelle malibu         18.0          8         130    3504
7               chevrolet impala         14.0          8         220    4354
8          chevrolet monte carlo         15.0          8         150    3761
9                      chevy c20         10.0          8         200    4376
10           dodge challenger se         15.0          8         170    3563
11                    dodge d200         11.0          8         210    4382
12                     ford f250         10.0          8         215    4615
13              ford galaxie 500         15.0          8         198    4341
14                 ford maverick         21.0          6          85    2587
15                   ford torino         17.0          8         140    3449
16                      hi 1200d          9.0          8         193    4732
17            plymouth 'cuda 340         14.0          8         160    3609
18               plymouth duster         22.0          6          95    2833
19             plymouth fury iii         14.0          8         215    4312
20            plymouth satellite         18.0          8         150    3436
21              pontiac catalina         14.0          8         225    4425
22                   audi 100 ls         24.0          4          90    2430
23                      bmw 2002         26.0          4         113    2234
24                   peugeot 504         25.0          4          87    2672
25                      saab 99e         25.0          4          95    2375
26  volkswagen 1131 deluxe sedan         26.0          4          46    1835
27                  datsun pl510         27.0          4          88    2130
28         toyota corona mark ii         24.0          4          95    2372

    Year    Origin
0     70  American
1     70  American
2     70  American
3     70  American
4     70  American
5     70  American
6     70  American
7     70  American
8     70  American
9     70  American
10    70  American
11    70  American
12    70  American
13    70  American
14    70  American
15    70  American
16    70  American
17    70  American
18    70  American
19    70  American
20    70  American
21    70  American
22    70  European
23    70  European
24    70  European
25    70  European
26    70  European
27    70  Japanese
28    70  Japanese  )

## Convert the tuple object in to a dictionary object

In [8]:
dictionary_tuple_groupby_df = dict(tuple_groupby_df)
dictionary_tuple_groupby_df[80].head()

,Model,Actual MPG,Cylinders,Horsepower,Weight,Year,Origin
307,amc concord,24.3,4,90,3003,80,American
308,chevrolet chevette,32.1,4,70,2120,80,American
309,chevrolet citation,28.0,4,90,2678,80,American
310,dodge aspen,19.1,6,90,3381,80,American
311,dodge colt,27.9,4,105,2800,80,American

## Solution in Single Line

In [9]:
final_dict = dict(tuple(imp_data.groupby("Year")))
final_dict[80].head()

,Model,Actual MPG,Cylinders,Horsepower,Weight,Year,Origin
307,amc concord,24.3,4,90,3003,80,American
308,chevrolet chevette,32.1,4,70,2120,80,American
309,chevrolet citation,28.0,4,90,2678,80,American
310,dodge aspen,19.1,6,90,3381,80,American
311,dodge colt,27.9,4,105,2800,80,American

## Comparing manual variable creation with dictionary objects

In [10]:
#### Manual creation of variables (slicing cars data for year 70)
cars_70 = imp_data[imp_data["Year"] == 70]

#### Checking the shape of the sliced variable
cars_70.shape

(29, 7)

In [11]:
#### Checking the shape using the dictionary we have created
dictionary_tuple_groupby_df[70].shape

(29, 7)